benchmarking-results/foundationdb_load.dat
/usr/bin/java  -classpath /home/azureadmin/Transactional-YCSB/conf:/home/azureadmin/Transactional-YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/azureadmin/Transactional-YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/azureadmin/Transactional-YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/azureadmin/Transactional-YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/azureadmin/Transactional-YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/azureadmin/Transactional-YCSB/foundationdb/target/foundationdb-binding-0.18.0-SNAPSHOT.jar:/home/azureadmin/Transactional-YCSB/foundationdb/target/dependency/fdb-java-5.2.5.jar:/home/azureadmin/Transactional-YCSB/foundationdb/target/dependency/log4j-1.2.17.jar:/home/azureadmin/Transactional-YCSB/foundationdb/target/dependency/slf4j-api-1.7.25.jar:/home/azureadmin/Transactional-YCSB/foundationdb/target/dependency/slf4j-log4j12-1.7.10.jar site.ycsb.Client -load -db site.ycsb.db.foundationdb.FoundationDBClient -s -P workloads/workloadt -p recordcount=5000000 -threads 10 -s
[OVERALL], RunTime(ms), 4717138
[OVERALL], Throughput(ops/sec), 1059.9647498122802
[TOTAL_GCS_G1_Young_Generation], Count, 1999
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 10425
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.22100265033586042
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1999
[TOTAL_GC_TIME], Time(ms), 10425
[TOTAL_GC_TIME_%], Time(%), 0.22100265033586042
[COMMIT], Operations, 5000000
[COMMIT], AverageLatency(us), 9401.619238
[COMMIT], MinLatency(us), 1625
[COMMIT], MaxLatency(us), 430335
[COMMIT], 95thPercentileLatency(us), 41855
[COMMIT], 99thPercentileLatency(us), 55999
[COMMIT], Return=OK, 5000000
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 59.1
[CLEANUP], MinLatency(us), 16
[CLEANUP], MaxLatency(us), 258
[CLEANUP], 95thPercentileLatency(us), 258
[CLEANUP], 99thPercentileLatency(us), 258
[START], Operations, 5000000
[START], AverageLatency(us), 3.6216982
[START], MinLatency(us), 1
[START], MaxLatency(us), 53471
[START], 95thPercentileLatency(us), 7
[START], 99thPercentileLatency(us), 13
[START], Return=OK, 5000000
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 21.177398
[INSERT], MinLatency(us), 10
[INSERT], MaxLatency(us), 57727
[INSERT], 95thPercentileLatency(us), 32
[INSERT], 99thPercentileLatency(us), 45
[INSERT], Return=OK, 5000000